---
kind: property
id: P:Autodesk.Revit.DB.Document.IsModified
zh: 文档、文件
source: html/1e67b9dd-2fca-0a54-91f6-620e550f6f56.htm
---
# Autodesk.Revit.DB.Document.IsModified Property

**中文**: 文档、文件

The state of changes made to the document.

## Syntax (C#)
```csharp
public bool IsModified { get; }
```